{"meta":{"title":"可可","subtitle":"","description":"","author":"可可","url":"http://yoursite.com"},"pages":[{"title":"about","date":"2018-09-30T09:25:30.000Z","updated":"2018-10-21T14:01:08.673Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"姓名：柯可 爱好，跑步，跳舞，编程 座右铭：比没有才华更可怕的，是拒绝成长 理想生活：不用吃的太好，穿的太好，住的太好，但必须自由自在，不感到任何压力，不做工作的奴隶，不受名利支配，有志同道合的伴侣，不受名利支配活泼可爱的孩子，丰衣足食，已经算是理想 生活警句：生活虽然一地鸡毛，但是依然要欢歌高进，成长之路虽然有玫瑰有坎坷，但什么都不能阻挡坚强的心。"}],"posts":[{"title":"","slug":"HEXO搭建博客之感悟","date":"2018-10-12T17:12:33.871Z","updated":"2018-10-21T13:28:47.882Z","comments":true,"path":"2018/10/13/HEXO搭建博客之感悟/","link":"","permalink":"http://yoursite.com/2018/10/13/HEXO搭建博客之感悟/","excerpt":"","text":"title: 个人感悟用 HEXO+GitHub建立自己的博客感悟!今天突然从网上看到一个快速的建立自己的博客网站，只需要30分钟就能建立一个简单的博客页面，而且页面的自适应能力还比较强，我有点惊呆了。 于是在放学之后，我一个人按照网上的安装步骤(在这里就不具体说怎么配置了，网上搜一下hexo+GitHub建立博客就能搜到大量的文章，讲的非常详细)，讲真的只要按照步骤来30分钟妥妥的就能建立一个博客，实在太nice。但同时我又在想一个问题，我从开学到现在花了一个月的时间，用javaweb建立了一个自己的博客（基本框架已经打好了，前后台基本实现了），但是我花了一个月的时间搭建的，而这个只需要30分钟，我感觉我实在太low了。感觉自己大三了，知识储量真的还达不到计算入门的知识储量，并且我查了，hexo是一个香港大三的学生觉得开发博客太难了，于是他自己开发了hexo(我好像从某个文章看见的，不知道是否正确，有点尴尬….)，专门用于建立博客开发的。这样一对比，感觉自己毕业以后都无法说自己大学是学计算机的。所以，自己要走的路还长啊！（感悟一） 第二，就是虽然hexo+github建立博客非常快，但是他只注重效率与便捷，如果自己真正的做一个博客就知道，建立一个自己博客不是那么容易的，考虑的因素太多了，不仅考虑起那天页面的设计与自适应，还考虑后台编辑，数据库的建立，与服务器的架构，等等知识。虽然我话费一个月的时间来编自己的博客。但是我学到的知识比用30 分钟建立自己博客学到的知识多了几倍，所以说，有时候有的工具虽然是方便了我们，但有时候会让我们只知道器表面现象，而不真正了解内部情况，还是踏踏实实的学习为好，基础还是挺重要的(感悟二)。 第三，眼界太窄，知识来源少，阅读量太少，假如说，自己以前都知道hexo可以恒快的搭建一个博客，那我肯定不会自己去做，因为自己知道有个很好的工具帮助我们，为什么还要浪费自己时间与精力去做尼，这就足以说明自己知识的来源仅仅限于课本与老师，并不关心现在技术的发展。并且也不怎么去读一些本专业的书籍来丰富自己。（感悟三） 最后，只想对自己说，路漫漫其修远兮，吾将上下而求索，自己要掌握的知识还很多，还需要不断的积累与探索啊。本文章不仅仅给与自己，如果你恰好看到这篇文章，会有什么感悟尼。不多说了，赶紧去学习恰！！！！！","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2018-10-12T09:35:09.509Z","updated":"2018-10-12T09:35:09.512Z","comments":true,"path":"2018/10/12/hello-world/","link":"","permalink":"http://yoursite.com/2018/10/12/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}